# Interview Questions 

**17-04-2025**

1. Write an SQL query to retrieve all columns from a table named "employees".
2. How do you write a query to select distinct values from a column in a table?
3. Create an SQL query to update the "salary" column in the "employees" table where the "department" is "HR".
4. Write an SQL query to delete rows from a table named "customers" where the "age" column is less than 18.
5. How would you write an SQL query to insert a new record into a table named "products" with values for "name", "price", and "quantity"?

**1. Write an SQL query to retrieve all columns from a table named "employees".**

```sql
create database 360digiTMG;

use 360digiTMG;

create table Employes(
	id int primary key, 
    name varchar(100), 
    department varchar(100), 
    salary varchar(100)
);

insert  into  Employes values (1, "Revanth kumar", "Data science", "1,00,000");
insert  into  Employes values (2, "Sam", "AI developer", "2,00,000");
insert  into  Employes values (3, "wick", "UI developer", "50,000");

select * from Employes;
```

**2. How do you write a query to select distinct values from a column in a table?**

```sql
insert into SalaryEmploye values ("1,00,000");
insert into SalaryEmploye values ("2,00,000");
insert into SalaryEmploye values ("1,00,000");
insert into SalaryEmploye values ("2,00,000");
insert into SalaryEmploye values ("10,00,000");

select distinct salary from SalaryEmploye;
```

**3. Create an SQL query to update the "salary" column in the "employees" table where the "department" is "HR".**

```sql

insert  into  Employes values (4, "ravi", "HR", "10,000");

select department, salary from Employes where department = "HR";

update Employes set salary = "5,000" where department = "HR";

```

**4. Write an SQL query to delete rows from a table named "customers" where the "age" column is less than 18.**

```sql

create table EmployesTwo(
	id int primary key, 
    name varchar(100), 
    department varchar(100), 
    salary varchar(100), 
    age int
);

insert into EmployesTwo  values (1, "Revanth kumar", "Data science", "1,00,000", 25);
insert into EmployesTwo  values (2, "raju", "Data science", "1,00,000", 17);

delete from EmployesTwo where age < 18;

select * from EmployesTwo;

```

**5. How would you write an SQL query to insert a new record into a table named "products" with values for "name", "price", and "quantity"?**

```sql
create table product(
    id int primary key, 
    name varchar(100),
    price decimal(0,0),
    quantity int
);

insert into product (id, name, price, quantity) values (1, "apple", "50.37", 5);

select * from product;
```